IDEA Open Model
ConnectionSetup.RigidBP Property
Compatible with IDEA StatiCa Beta 20.0
 True if rigid base plate is considered
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public bool RigidBP { get; set; }
Public Property RigidBP As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace